#+title:     Exercises in SICP Chapter 4
#+author:    Jason Huang
#+email:     huangmianrui0310@outlook.com
#+date:      <2021-04-08 Thu>

#+description:  Exercises and solutions in SICP chapter 4
#+keywords:     sicp, exercises, solutions, lisp, scheme
#+language:     en
#+startup:      content
#+exclude_tags: noexport

#+LATEX_HEADER: \usepackage{minted}

*** Solution

#+begin_src scheme
(define (distinct? items)
  (cond ((null? items) true)
        ((null? (cdr items)) true)
        ((member (car items) (cdr items)) false)
        (else (distinct? (cdr items)))))
(define (perms seq1 seq2)
  (if (null? seq2)
      '()
      (append
       (map
        (lambda (s)
          (cons s
                (if (pair? (car seq2))
                    (car seq2)
                    (list (car seq2)))))
        seq1)
       (perms seq1 (cdr seq2)))))
(define (nearby? a b)
  (= (abs (- a b)) 1))
(define (ordinary-multiple-dwelling)
  (let* ((c-m       (filter
                     (lambda (t) (> (cadr t) (car t)))
                     (perms '(2 3 4 5) '(3 4 5))))
         (f-c-m     (filter
                     (lambda (t) (and (distinct? t) (not (nearby? (car t) (cadr t)))))
                     (perms '(2 3 4) c-m)))
         (s-f-c-m   (filter
                     (lambda (q) (and (distinct? q) (not (nearby? (car q) (cadr q)))))
                     (perms '(1 2 3 4 5) f-c-m)))
         (b-s-f-c-m (filter
                     distinct?
                     (perms '(1 2 3 4) s-f-c-m))))
    (if (null? b-s-f-c-m)
        false
        (map list '(baker smith fletcher cooper miller) (car b-s-f-c-m)))))
(ordinary-multiple-dwelling)
#+end_src

#+RESULTS:
| baker    | 3 |
| smith    | 1 |
| fletcher | 4 |
| cooper   | 2 |
| miller   | 5 |

